export default {
    data() {
        return {
            courseItems: [
                {
                    id: 1,
                    courseImage: "/img/courses/tag/course_نورانية 1.png",
                    development: false,
                    badge: 'العربية',
                    badgeClass: 'category-color category-color-1',
                    title: 'التأسيس الهجائي وفقا للقاعدة النورانية',
                    level: 'مبتديء :',
                    beginer: 'Beginner',
                    description: `تعلم القراءة الصحيحة للقرآن الكريم مع التجويد، من خلال ربط الحروف والأصوات بالكلمات والجمل ، حيث تعد القاعدة النورانية بمثابة التجويد العملي للقرآن الكريم وهجاء اللغة العربية .`,
                    infoList: [
                        {
                            infoListTitle: 'تعلم الحروف المفردة : الحروف الهجائية مع التمييز بين الممدودة والمقصورة.'
                        },
                        {
                            infoListTitle: 'الحروف المركبة : تعليم الحروف عندما تُدمج لتكوين كلمات.'
                        },
                        {
                            infoListTitle: 'الحركات : فتح الحروف وضمها وكسرها مع تعليم المدود.'
                        },
                        {
                            infoListTitle: 'التطبيق العملي : قراءة القرآن الكريم مع تطبيق ما تم تعلمه.'
                        },
                        {
                            infoListTitle: 'التدريب على الكلمات والجمل : الانتقال إلى قراءة الآيات القرآنية بالتدريج.'
                        }
                    ],
                    viewBtn: 'View Details',
                    wishIcon: 'flaticon-like',
                    shareIcon: 'fal fa-shopping-cart',
                    duration: '٣٦ ساعة مقابل ٣٦ درس',
                    lessonIcon: '<svg xmlns="http://www.w3.org/2000/svg" width="16.471" height="16.471"viewBox="0 0 16.471 16.471"><g id="blackboard-8"transform="translate(-0.008)"><path id="Path_106" data-name="Path 101"d="M16,1.222H8.726V.483a.483.483,0,1,0-.965,0v.74H.491A.483.483,0,0,0,.008,1.7V13.517A.483.483,0,0,0,.491,14H5.24L4.23,15.748a.483.483,0,1,0,.836.483L6.354,14H7.761v1.99a.483.483,0,0,0,.965,0V14h1.407l1.288,2.231a.483.483,0,1,0,.836-.483L11.247,14H16a.483.483,0,0,0,.483-.483V1.7A.483.483,0,0,0,16,1.222Zm-.483.965v8.905H.973V2.187Zm0,10.847H.973v-.976H15.514Z"fill="#575757" /></g></svg>',
                    price: '$12.57',
                    priceOld: '$24.50',
                    courseTitle: 'القاعدة النورانية',
                    instructor: 'اسلام المسلمانى',
                    instructorImage: '/img/portfilo/course-tutor-01.png',
                    instructorUrl: '/instructor-profile',
                    rating: '(25)',
                    productRating1: 'fas fa-star',
                    productRating2: 'fas fa-star',
                    productRating3: 'fas fa-star',
                    productRating4: 'fas fa-star',
                    productRating5: 'fal fa-star',
                    clock: '1:33 Min',
                    credit: '8 Credit',
                    network: 'Fresh',
                    shortDesc: 'تعلم القراءة الصحيحة للقرآن الكريم مع التجويد، من خلال ربط الحروف والأصوات بالكلمات والجمل ، حيث تعد القاعدة النورانية بمثابة التجويد العملي للقرآن الكريم وهجاء اللغة العربية .',
                    lessons: [
                        "التعريف بالقاعدة النورانية ، ومقدمة عن حروف الهجاء ، ثم دراسة حرف الهمزة من حيث ( الشكل ، الصوت ، المخرج ، صفته من حيث التفخيم والترقيق ) = ساعة",
                        "دراسة حروف ( ب ت ث ) من حيث : الشكل ، الصوت ، المخرج ، الصفة من حيث التفخيم والترقيق = ساعة",
                        "دراسة حروف ( ج ح خ ) من حيث : الشكل ، الصوت ، المخرج ، الصفة من حيث التفخيم والترقيق = ساعة",
                        "دراسة حروف ( د ، ذ ، ر ، ز ) من حيث الشكل ، الصوت ، المخرج ، الصفة من حيث التفخيم والترقيق = ساعة",
                        "دراسة حروف ( س ، ش ) من حيث : الشكل ، الصوت ، المخرج ، الصفة من حيث التفخيم والترقيق ، ثم الإشارة إلى صفة الصفير وحروفه = ساعة",
                        "دراسة حروف ( ص ، ض ، ط ، ظ ) من حيث : الشكل ، الصوت ، المخرج ، الصفة من حيث التفخيم والترقيق ، ثم الإشارة إلى صفة الإطباق والاستعلاء = ساعة",
                        "دراسة حروف ( ع ، غ ، ف ، ق ) من حيث : الشكل ، الصوت ، المخرج ، الصفة من حيث التفخيم والترقيق = ساعة",
                        "دراسة حروف ( ك ، ل ، م ، ن ) من حيث الشكل ، الصوت ، المخرج ، الصفة من حيث التفخيم والترقيق = ساعة",
                        "دراسة حروف ( هـ ، و ، ي ، الألف المدية ) من حيث : الشكل ، الصوت ، المخرج ، الصفة من حيث التفخيم والترقيق ثم الإشارة إلى مخرج الجوف = ساعة",
                        "دراسة الحروف بشكل مركب ، والتعرف على أنواع الخطوط العربية ، ورسم المصحف العثماني والتمييز بين الأشكال المختلفة لكل حرف = ساعة",
                        "تابع دراسة الحروف المركبة = ساعة",
                        "التعرف على الحروف المقطعة وما يتعلق بها من حيث العدد وأحكام المدود ، وأقوال العلماء في معانيها = ساعة",
                        "تدريبات ومراجعة على ما سبق = ساعة",
                        "أنواع الحركات في اللغة العربية = ساعة",
                        "أنواع التنوين ، والفرق بينه وبين النون الساكنة = ساعة",
                        "تدريبات على الحركات والتنوين = ساعة",
                        "الألف الصغيرة والياء الصغيرة والواو الصغيرة = ساعة",
                        "حروف المد واللين ، أولا : المد ، وشرح المد الطبيعي = ساعة",
                        "ثانيا : حروف اللين = ساعة",
                        "تدريبات على التنوين وأحرف المد الثلاثة ، وحرفي اللين = ساعة",
                        "تابع التدريبات السابقة = ساعة",
                        "السكون وما يتعلق به من أحكام القلقلة واللام القمرية = ساعة",
                        "تدريبات هجائية على السكون وعلى ما سبق = ساعة",
                        "تابع تدريبات على السكون = ساعة",
                        "تابع تدريبات على السكون = ساعة",
                        "الشدة وما يتعلق بها من أحكام ( الميم والنون المشددتين) = ساعة",
                        "تدريبات على الشدة = ساعة",
                        "تابع تدريبات على الشدة = ساعة",
                        "اختبار على ما سبق = ساعة"
                    ],
                    applyBtn: 'Apply now',
                    year: '6 Years',
                }
            ],
        }
    }
}

